---
kind: other
id: Methods.T:Autodesk.Revit.DB.BRepBuilderPersistentIds
source: html/0d513997-48bb-f20e-cc80-4bbbb0ededaa.htm
---
# BRepBuilderPersistentIds Methods

Adds a correspondence between an ExternalGeometryId and a BRepBuilderGeometryId.
 Note that an existing correspondence in the map cannot be updated and that a
 particular BRepBuilderGeometryId may be related to at most one ExternalGeometryId.